## 1.
while True:
    print('Вы пришли в магазин. Тут есть нужная книга?')
    ans = input('Введите ответ: ')
    if ans == 'да':
        print('Книга куплена.')
        break
    else:
        print('Идём в другой магазин.')
## 2.
d = int(input("Введите номер дня недели: "))
if d == 1:
    print("Понедельник")
elif d == 2:
    print("Вторник")
elif d == 3:
    print("Среда")
elif d == 4:
    print("Четверг")
elif d == 5:
    print("Пятница")    
elif d == 6:
    print("Суббота")
elif d == 7:
    print("Воскресенье")
else:
    print("Такого дня не существует")
## 3.
a = int(input("Введите 1 число - "))
a1 = int(input("выберите единицу измерения числа: 1) бит 2) байт 3) кбайт 4) мбайт  -- "))
b1 = int(input("выберите единицу измерения в которую хотите преобразовать : 1) бит 2) байт 3) кбайт 4) мбайт  -- "))
if a1 == 1:
    if b1 == 1:
        print(a, "бит =", a, "бит ")
    elif b1 == 2:
        print(a, "бит =", a * 0.125, "байт")
    elif b1 == 3:
        print(a, "бит =", a * 0.00012207031, "кбайт")
    elif b1 == 4:
        print(a, "бит =", a * 0.000000119209289, "мбайт")
    else:
        print("вы ввели не правильный номер")
elif a1 == 2:
    if b1 == 1:
        print(a, "байт =", a * 8, "бит")
    elif b1 == 2:
        print(a, "байт =", a, "байт")
    elif b1 == 3:
        print(a, "байт =", a * 0.0009765625, "кбайт")
    elif b1 == 4:
        print(a, "байт =", a * 0.000000953674316, "мбайт")
    else:
        print("вы ввели не правильный номер")
if a1 == 3:
    if b1 == 1:
        print(a, "кбайт =", a * 8192, "бит")
    elif b1 == 2:
        print(a, "кбайт =", a * 1024, "байт")
    elif b1 == 3:
        print(a, "кбайт =", a, "кбайт")
    elif b1 == 4:
        print(a, "кбайт =", a * 0.0009765625, "мбайт")
    else:
        print("вы ввели не правильный номер")
elif a1 == 4:
    if b1 == 1:
        print(a, "мбайт =", a * 8388608, "бит")
    elif b1 == 2:
        print(a, "мбайт =", a * 1048576, "байт")
    elif b1 == 3:
        print(a, "мбайт =", a * 1024, "кбайт")
    elif b1 == 4:
        print(a, "мбайт =", a, "мбайт")
    else:
        print("вы ввели не правильный номер")
else:
    print("вы ввели не правильный номер")
## 4.
a = int(input("Введите число: "))
if a != 0:
    if a > 0:
        print("Положительное число.")
    else:
        print(a * (-1))
else:
    print("Число равно 0.")
## 5.
a = int(input("Введите число: "))
i = 1 
while i < 11:
    i += 1
    a += 1
    print(a)












